#Запустимо збирання всіх образів (необхідно перебувати в директорії з docker-compose.yml):
docker compose build

#Тепер достатньо виконати з директорії в якій знаходиться docker-compose.yml наступну команду:
docker compose up -d

#після завершення запуску можна буде переглянути результат у вашому браузері за адресою http://127.0.0.1
#(ви можете призначити окреме домене імʼя, використовуючи файл hosts вашої ОС)
#Доступні сервіси можливо побачити за допомогою команди
docker compose ps

#Зупинити роботу всіх сервісів (необхідно перебувати в директорії з docker-compose.yml):
docker compose down